/*
 * modbus_slave_map.h
 *
 * Created: 30.03.2020 23:15:38
 *  Author: User
 */ 


#ifndef MODBUS_SLAVE_MAP_H_
#define MODBUS_SLAVE_MAP_H_

/*_____ I N C L U D E S ____________________________________________________*/



/*_____ M A C R O S ________________________________________________________*/



/*_____ D E F I N I T I O N ________________________________________________*/


//------------------------------------------------------------
//		АДРЕСА MODBUS, РЕГИОН HOLDING
//------------------------------------------------------------


#define MODBUS_MAP_PASSPORT					0x0000								//	"Паспорт прибора";
#define	MODBUS_MAP_DEVICE_NUM				0x0004


/*_____ D E C L A R A T I O N ______________________________________________*/



#endif /* MODBUS_SLAVE_MAP_H_ */